micropython/micropython/ports/espressif/boards/lilygo_ttgo_t8_s2/mpconfigboard.h
// This file is part of the CircuitPython project: https://circuitpython.org
//
// SPDX-FileCopyrightText: Copyright (c) 2022 Fabian Affolter <fabian@affolter-engineering.ch>
//
// SPDX-License-Identifier: MIT

// Micropython setup

#define MICROPY_HW_BOARD_NAME       "LILYGO TTGO T8 ESP32-S2"
#define MICROPY_HW_MCU_NAME         "ESP32S2"
